<details ><summary>apply for core 2025-01-02 03:45:06 (UTC)</summary>
    <details ><summary>Locking successful</summary>
  Project LumeWeb/pinner.xyz-devops#core has been locked by PR #1
</details>

<details ><summary>Apply output</summary>

```terraform
OpenTofu will perform the following actions:

  # cloudns_dns_record.renterd will be created
  + resource "cloudns_dns_record" "renterd" {
      + id    = (known after apply)
      + name  = "pinner-core-renterd-solo.node"
      + ttl   = 600
      + type  = "CNAME"
      + value = (known after apply)
      + zone  = "pinner.xyz"
    }

  # cloudns_dns_record.renterd_s3 will be created
  + resource "cloudns_dns_record" "renterd_s3" {
      + id    = (known after apply)
      + name  = "s3.pinner-core-renterd-solo.node"
      + ttl   = 600
      + type  = "CNAME"
      + value = (known after apply)
      + zone  = "pinner.xyz"
    }

  # module.etcd.module.etcd_deployment.akash_deployment.service will be created
  + resource "akash_deployment" "service" {
      + deployment_dseq               = (known after apply)
      + deployment_gseq               = (known after apply)
      + deployment_oseq               = (known after apply)
      + deployment_owner              = (known after apply)
      + deployment_state              = (known after apply)
      + escrow_account_balance_amount = (known after apply)
      + escrow_account_balance_denom  = (known after apply)
      + escrow_account_owner          = (known after apply)
      + id                            = (known after apply)
      + last_updated                  = (known after apply)
      + provider_address              = (known after apply)
      + sdl                           = (sensitive value)
      + services                      = (known after apply)

      + provider_filters {
          + enforce   = true
          + providers = [
              + "akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn",
            ]
        }
    }

  # module.mysql.module.mysql_deployment.akash_deployment.service will be created
  + resource "akash_deployment" "service" {
      + deployment_dseq               = (known after apply)
      + deployment_gseq               = (known after apply)
      + deployment_oseq               = (known after apply)
      + deployment_owner              = (known after apply)
      + deployment_state              = (known after apply)
      + escrow_account_balance_amount = (known after apply)
      + escrow_account_balance_denom  = (known after apply)
      + escrow_account_owner          = (known after apply)
      + id                            = (known after apply)
      + last_updated                  = (known after apply)
      + provider_address              = (known after apply)
      + sdl                           = (sensitive value)
      + services                      = (known after apply)

      + provider_filters {
          + enforce   = true
          + providers = [
              + "akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn",
            ]
        }
    }

  # module.renterd.module.renterd_deployment.akash_deployment.service will be created
  + resource "akash_deployment" "service" {
      + deployment_dseq               = (known after apply)
      + deployment_gseq               = (known after apply)
      + deployment_oseq               = (known after apply)
      + deployment_owner              = (known after apply)
      + deployment_state              = (known after apply)
      + escrow_account_balance_amount = (known after apply)
      + escrow_account_balance_denom  = (known after apply)
      + escrow_account_owner          = (known after apply)
      + id                            = (known after apply)
      + last_updated                  = (known after apply)
      + provider_address              = (known after apply)
      + sdl                           = (sensitive value)
      + services                      = (known after apply)

      + provider_filters {
          + enforce   = true
          + providers = [
              + "akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn",
            ]
        }
    }

Plan: 5 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + etcd_endpoint       = (known after apply)
  + mysql_endpoint      = (known after apply)
module.etcd.module.etcd_deployment.akash_deployment.service: Creating...
module.etcd.module.etcd_deployment.akash_deployment.service: Still creating... [10s elapsed]
module.etcd.module.etcd_deployment.akash_deployment.service: Still creating... [20s elapsed]
module.etcd.module.etcd_deployment.akash_deployment.service: Creation complete after 23s [id=19616409:1:1:akash1nd8v8nc9ufzguwg3yu4fm9q02q72r6y4fhwkg2:akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn]
module.mysql.module.mysql_deployment.akash_deployment.service: Creating...
module.mysql.module.mysql_deployment.akash_deployment.service: Still creating... [10s elapsed]
module.mysql.module.mysql_deployment.akash_deployment.service: Creation complete after 18s [id=19616413:1:1:akash1nd8v8nc9ufzguwg3yu4fm9q02q72r6y4fhwkg2:akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn]
module.renterd.module.renterd_deployment.akash_deployment.service: Creating...
module.renterd.module.renterd_deployment.akash_deployment.service: Still creating... [10s elapsed]
module.renterd.module.renterd_deployment.akash_deployment.service: Creation complete after 18s [id=19616416:1:1:akash1nd8v8nc9ufzguwg3yu4fm9q02q72r6y4fhwkg2:akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn]
cloudns_dns_record.renterd: Creating...
cloudns_dns_record.renterd_s3: Creating...
cloudns_dns_record.renterd: Creation complete after 1s [id=564774697]
cloudns_dns_record.renterd_s3: Creation complete after 1s [id=564774698]

Apply complete! Resources: 5 added, 0 changed, 0 destroyed.

Outputs:

base_domain = "pinner.xyz"
environment = "prod"
etcd_endpoint = "http://provider.ny-01.node.infra.lumeweb.com:32596"
etcd_password = <sensitive>
etcd_username = <sensitive>
mysql_endpoint = "provider.ny-01.node.infra.lumeweb.com:31684"
renterd_endpoint = "pinner-core-renterd-solo.node.pinner.xyz"
renterd_s3_endpoint = "s3.pinner-core-renterd-solo.node.pinner.xyz"

```
</details>

</details>